simpleFoam/campagneUniformG0Rotation/H045C/D050L474W050G000H045V015_C/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volVectorFieldValue U (0.15 0 0)
	//volScalarFieldValue alpha.water 0
);

regions
(
    /*
    boxToCell
    {
        box (-1.5 -0.395 0) (3 0.395 0.2);
        fieldValues
        (
            volVectorFieldValue U (0.2 0 0)
			//volScalarFieldValue alpha.water 1
        );
    }
    */
);


// ************************************************************************* //
